# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
# anchors 0.02403846, 0.03125 , 0.03846154, 0.07211538, 0.07932692, 0.05528846, 0.07211538, 0.14663462, 0.14903846, 0.10817308, 0.14182692, 0.28605769, 0.27884615, 0.21634615, 0.375, 0.47596154, 0.89663462, 0.78365385
# 288 >> [7,9, 11,21, 23,16] [21,42, 43,31, 41,82] [80,62, 108,137, 258,226] # 416 >> [10,13, 16,30, 33,23] [30,61, 62,45, 59,119] [116,90, 156,198, 373,326]   
anchors:
  - [7,9, 11,21, 23,16]  # P3/8 
  - [21,42, 43,31, 41,82]  # P4/16
  - [80,62, 108,137, 258,226]  # P5/32

# mobilev2 backbone
backbone:
  # [from, number, module, args]  conv = [out_ch, k, s, p],  InvertedResidual = [out_ch, s, expansion]
  [[-1, 1, Convrelu6, [32, 3, 2]],  # 0-P1/2
   [-1, 1, InvertedResidual, [16, 1, 1]],  
   [-1, 1, InvertedResidual, [24, 2, 6]],  # 2-P2/4
   [-1, 1, InvertedResidual, [24, 1, 6]],  
   [-1, 1, InvertedResidual, [32, 2, 6]],  # 4-P3/8
   [-1, 2, InvertedResidual, [32, 1, 6]], 
   [-1, 1, InvertedResidual, [64, 2, 6]],  # 6-P4/16
   [-1, 3, InvertedResidual, [64, 1, 6]],
   [-1, 1, InvertedResidual, [96, 1, 6]],  
   [-1, 2, InvertedResidual, [96, 1, 6]],
   [-1, 1, InvertedResidual, [160, 2, 6]], # 10-P5/32
   [-1, 2, InvertedResidual, [160, 1, 6]],
   [-1, 1, InvertedResidual, [320, 1, 6]], # 12
  ]

# YOLOv3 head
head:
  [[-1, 2, InvertedResidual_noskip, [320, 1, 3]],  # Extra layers
   [-1, 1, Convrelu6, [256, 3, 1]],
   [-1, 1, Convrelu6, [512, 3, 1]],  # 15 (P5/32-yolo-large) before yolo1

   [-2, 1, InvertedResidual_noskip, [160, 1, 3]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, Convrelu6, [96, 3, 1]],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4

   [-1, 1, InvertedResidual_noskip, [96, 1, 3]],
   [-1, 1, InvertedResidual_noskip, [64, 1, 3]],
   [-1, 1, Convrelu6, [128, 3, 1]],
   [-1, 1, Convrelu6, [256, 3, 1]],  # 23 (P4/16-yolo-medium) before yolo2

   [-2, 1, InvertedResidual_noskip, [64, 1, 3]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, Convrelu6, [32, 3, 1]],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3

   [-1, 1, InvertedResidual_noskip, [128, 1, 3]],
   [-1, 2, InvertedResidual_noskip, [128, 1, 3]], # 29 (P3/8-yolo-small) before yolo3

   [[29, 23, 15], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
